{
  "amazon": [],
  "nyt": [
    {
      "rank": 1,
      "title": "VIGIL",
      "author": "George Saunders",
      "isbn": "9780525509622",
      "description": "In the waning hours of an oil company chief executive’s life, worldly and otherworldly visitors put his time on Earth in perspective.",
      "image": "https://static01.nyt.com/bestsellers/images/9780525509622.jpg",
      "source": "NYT"
    },
    {
      "rank": 2,
      "title": "THE CORRESPONDENT",
      "author": "Virginia Evans",
      "isbn": "9780593798430",
      "description": "Letters from someone she used to know push Sybil Van Antwerp toward revisiting her past and finding a way to forgive.",
      "image": "https://static01.nyt.com/bestsellers/images/9780593798430.jpg",
      "source": "NYT"
    },
    {
      "rank": 3,
      "title": "HALF HIS AGE",
      "author": "Jennette McCurdy",
      "isbn": "9780593723739",
      "description": "A 17-year-old named Waldo has an inexplicable attraction to her creative writing teacher.",
      "image": "https://static01.nyt.com/bestsellers/images/9780593723739.jpg",
      "source": "NYT"
    },
    {
      "rank": 4,
      "title": "PENDERGAST: THE BEGINNING",
      "author": "Douglas Preston and Lincoln Child",
      "isbn": "9781538765746",
      "description": "Agent Pendergast’s ghastly first case involves a suspension and ritualistic killings.",
      "image": "https://static01.nyt.com/bestsellers/images/9781538765746.jpg",
      "source": "NYT"
    },
    {
      "rank": 5,
      "title": "BURN DOWN MASTER'S HOUSE",
      "author": "Clay Cane",
      "isbn": "9781496759146",
      "description": "Acts of resistance are made by enslaved persons in the American South.",
      "image": "https://static01.nyt.com/bestsellers/images/9781496759146.jpg",
      "source": "NYT"
    },
    {
      "rank": 6,
      "title": "THE WIDOW",
      "author": "John Grisham",
      "isbn": "9780385548984",
      "description": "When Simon Latch, a lawyer in rural Virginia, is accused of murder, he goes in search of the real killer.",
      "image": "https://static01.nyt.com/bestsellers/images/9780385548984.jpg",
      "source": "NYT"
    },
    {
      "rank": 7,
      "title": "ALCHEMISED",
      "author": "SenLinYu",
      "isbn": "9780593972700",
      "description": "After the war, an imprisoned alchemist is sent to a necromancer to recover her lost memories.",
      "image": "https://static01.nyt.com/bestsellers/images/9780593972700.jpg",
      "source": "NYT"
    },
    {
      "rank": 8,
      "title": "MY HUSBAND'S WIFE",
      "author": "Alice Feeney",
      "isbn": "9781250337818",
      "description": "In an old house in a seaside town, things may not be what they appear to be.",
      "image": "https://static01.nyt.com/bestsellers/images/9781250337818.jpg",
      "source": "NYT"
    },
    {
      "rank": 9,
      "title": "THE SECRET OF SECRETS",
      "author": "Dan Brown",
      "isbn": "9780385546898",
      "description": "As he searches for the missing noetic scientist he has been seeing, Robert Langdon discovers something regarding a secret project.",
      "image": "https://static01.nyt.com/bestsellers/images/9780385546898.jpg",
      "source": "NYT"
    },
    {
      "rank": 10,
      "title": "HER SOUL FOR REVENGE",
      "author": "Harley Laroux",
      "isbn": "9781496758248",
      "description": "The second book in the Souls trilogy. Juniper gives her soul to Zane so he will exact revenge on a cult but now he wants her heart too.",
      "image": "https://static01.nyt.com/bestsellers/images/9781496758248.jpg",
      "source": "NYT"
    },
    {
      "rank": 11,
      "title": "BRIMSTONE",
      "author": "Callie Hart",
      "isbn": "9781538774229",
      "description": "The second book in the Fae & Alchemy series. To save those close to them, Saeris and Fisher face a new set of dangers.",
      "image": "https://static01.nyt.com/bestsellers/images/9781538774229.jpg",
      "source": "NYT"
    },
    {
      "rank": 12,
      "title": "THE THINGS WE LEAVE UNFINISHED",
      "author": "Rebecca Yarros",
      "isbn": "9781682816523",
      "description": "After a divorce, Georgia Stanton returns to Colorado and tries to protect her great-grandmother’s incomplete manuscript.",
      "image": "https://static01.nyt.com/bestsellers/images/9781682816523.jpg",
      "source": "NYT"
    },
    {
      "rank": 13,
      "title": "THE FIRST TIME I SAW HIM",
      "author": "Laura Dave",
      "isbn": "9781668002964",
      "description": "Hannah’s husband turns up five years after he disappeared, which forces her to go on the run with her daughter.",
      "image": "https://static01.nyt.com/bestsellers/images/9781668002964.jpg",
      "source": "NYT"
    },
    {
      "rank": 14,
      "title": "ANATOMY OF AN ALIBI",
      "author": "Ashley Elston",
      "isbn": "9780593834459",
      "description": "Two women enact a plan to uncover truths a man may have been hiding, but things go awry when he is found murdered.",
      "image": "https://static01.nyt.com/bestsellers/images/9780593834459.jpg",
      "source": "NYT"
    },
    {
      "rank": 15,
      "title": "CARL'S DOOMSDAY SCENARIO",
      "author": "Matt Dinniman",
      "isbn": "9780593820261",
      "description": "The second book in the \"Dungeon Crawler Carl\" series. Carl and Donut confront an ancient spell and heightened dangers.",
      "image": "https://static01.nyt.com/bestsellers/images/9780593820261.jpg",
      "source": "NYT"
    }
  ],
  "bn": [],
  "google": [
    {
      "rank": 1,
      "title": "The Visitor",
      "author": "Lee Child",
      "isbn": "9780553811889",
      "description": "\"Sergeant Amy Callan and Lieutenant Caroline Cook have a lot in common. Both were army high-flyers. Both were acquainted with Jack Reacher. Both were forced to resign from the service. Now they're both dead. Both were found in their own home, naked, in a bath full of paint. Both apparent victims of an army man. A loner, a smart guy with a score to settle, a ruthless vigilante. A man just like Jack Reacher.\"--Cover.",
      "image": "http://books.google.com/books/content?id=UGUahZnpa0MC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 2,
      "title": "The Picture of Dorian Gray",
      "author": "Oscar Wilde",
      "isbn": "9780359788330",
      "description": "The Picture of Dorian Gray is the only published novel by Oscar Wilde, appearing as the lead story in Lippincott's Monthly Magazine on 20 June 1890, printed as the July 1890 issue. The magazine's editors feared the story was indecent as submitted, so they censored roughly 500 words, without Wilde's knowledge, before publication. But even with that, the story was still greeted with outrage by British reviewers, some of whom suggested that Wilde should be prosecuted on moral grounds, leading Wilde to defend the novel aggressively in letters to the British press. Today, Wilde's fin de siècle novella is considered a classic. This new edition from Immortal Books includes footnotes and images.",
      "image": "http://books.google.com/books/content?id=6vGiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 3,
      "title": "The Mephisto Club",
      "author": "Tess Gerritsen",
      "isbn": "9781409094975",
      "description": "'Gruesome, seductive and creepily credible' The Times 'I HAVE SINNED' The words are scrawled in blood at the most shocking murder scene Forensic Pathologist Maura Isles and Detective Jane Rizzoli have ever witnessed. The victim, a young woman, has been entirely drained of blood and horrifically dismembered. When there's a second murder, the police uncover a link to a secret society known as the Mephisto Club. Their mission is a terrifying one - to find the true source of evil on earth. But has evil already found them? - The Mephisto Club is the sixth book in Tess Gerritsen's bestselling Rizzoli & Isles series, and the inspiration behind the hit TV show",
      "image": "http://books.google.com/books/content?id=ItDATwppC2gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 4,
      "title": "Heart of the Hunter",
      "author": "Deon Meyer",
      "isbn": "9780802194657",
      "description": "A former assassin in post-apartheid South Africa is drawn back into his former profession in this \"rip-roaring adventure\" ( The Washington Post). Six-foot five-inch Thobela \"Tiny\" Mpayipheli was once a feared freedom fighter, trained by the Stasi and KGB. Now, he's a family man working in a garage in post-apartheid South Africa. But when the daughter of one of Tiny's former associates comes to him with a desperate plea, he finds himself returning to his violent former life. With his old friend Johnny being held hostage, Tiny agrees to do whatever it takes to get him back safely. But as he races to the rendezvous point on a stolen BMW motorcycle, Tiny is trailed by several hostile forces, including South Africa's Presidential Intelligence Unit. And when his old training kicks in, his pursuers will learn what kind of man they're up against . . . With books published in twenty languages, Deon Meyer has established himself as one of the best crime writers in the world. In Heart of the Hunter, he has created a thriller \"good enough to nip at the heels of Le Carré\" ( Kirkus Reviews). \"This guy is really good. Deon Meyer hooked me with this one right from the start.\" —Michael Connelly, New York Times–bestselling author of the Harry Bosch novels \"A portrait of spy-world duplicity and a look at South Africa's post-apartheid politics.\" — The Washington Post \"The dark, explosive side of Alexander McCall Smith's Botswana books, as full of love for the vast beauty of the country but also riddled by the anger of South Africa's recent racial and political struggles.\" — Chicago Tribune \"A brilliant American debut by Afrikaans writer Deon Meyer, uses political intrigue as the fuel for a fast-paced crime thriller.\" — The Times-Picayune",
      "image": "http://books.google.com/books/content?id=-BJcvngpDkcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 5,
      "title": "How I Found Livingstone",
      "author": "Henry M. Stanley",
      "isbn": "9783382129910",
      "description": "Reprint of the original, first published in 1872. The publishing house Anatiposi publishes historical books as reprints. Due to their age, these books may have missing pages or inferior quality. Our aim is to preserve these books and make them available to the public so that they do not get lost.",
      "image": "http://books.google.com/books/content?id=D32yEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 6,
      "title": "Peter Camenzind",
      "author": "Hermann Hesse",
      "isbn": "0140181008",
      "description": "In his first successful novel, Hermann Hesse relates the story of Peter Camenzind, from his childhood in a remote mountain village to student life in Zurich.",
      "image": "http://books.google.com/books/content?id=3iY6PgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 7,
      "title": "Oliver Twist",
      "author": "Charles Dickens",
      "isbn": "9789388423038",
      "description": "JAICO ILLUSTARTED CLASSICS SERIES is a collection of beloved children’s classics read by generations all over the world. Rich with adventures and thrills, these immortal stories with vivid illustrations are designed to delight young readers. IN A RAMSHACKLE workhouse of a parish in England, a baby boy was born to a woman who died in childbirth. The boy was named OLIVER TWIST. He spent a sad childhood in abject misery in various workhouses. At the age of twelve, he runs away to London where he is picked up by a notorious criminal, Fagin, a mastermind at house breaking, pickpocketing and petty thievery. He teaches Oliver all these evil deeds. But a kind-hearted gentleman robbed by Fagin sympathizes with the plight of Oliver and helps him to find a family, his inheritance and above all Oliver’s true identity. CHARLES DICKENS was born in a little house in Landport, Portsea, England. The second of eight children, he grew up in a family frequently beset by financial insecurity. When the family fortunes improved, Dickens went back to school, after which he became an office boy, a freelance reporter, and finally an author.",
      "image": "http://books.google.com/books/content?id=3oSqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 8,
      "title": "The Worship of the Serpent",
      "author": "John Bathurst Deane",
      "isbn": "9781465577344",
      "image": "http://books.google.com/books/content?id=40o3CqBrgocC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 9,
      "title": "The World Set Free",
      "author": "H.G. Wells",
      "isbn": "9781473216952",
      "description": "In \"The World Set Free,\" H.G. Wells takes a science fictional look at the future, where if world peace is to be attained through labour internationalism, it will have to be at the price of complete social and economic reconstruction. But first comes a phase of revolution - violent, very bloody, and prolonged, which in the end may fail to achieve anything but social destruction . . . \"The World Set Free\" is a vision of highly educated and highly favoured leading and ruling men, voluntarily setting themselves to the task of reshaping the world.",
      "image": "http://books.google.com/books/content?id=Wl3JDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 10,
      "title": "Fugitive Pieces",
      "author": "Anne Michaels",
      "isbn": "0786212004",
      "description": "A stunning debut novel from an award-winning poet. Jakob Beer, traumatically orphaned as a young child during World War II, learns over his lifetime the power of language to destroy, omit, and obliterate, and also to restore, conjure and witness, as he comes to understand and experience the extent of what was lost to him and of what is possible to regain.",
      "image": "http://books.google.com/books/content?id=EIHmvTdDOVoC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 11,
      "title": "Taras Bulba",
      "author": "Nikolái V. Gogol",
      "isbn": "9788446023708",
      "description": "Feroces, crueles, valientes y apasionados, los cosacos hacen temblar la estepa bajo los cascos de sus caballos. Y entre ellos se encuentra Taras Bulba, un anciano lleno aún de fuerza e inteligencia que junto a sus hijos, Ostap y Andrí, avanzará por tierras polacas con intención de vengar su fe ortodoxa burlada por los católicos. Ninguna guarnición, ciudad amurallada o iglesia podrán detenerlos, hasta que la desgracia se cierna sobre ellos y el apuesto y enamoradizo Andrí haga que su padre maldiga el día en que lo engendró. Taras Bulba, una anomalía entre la obra más conocida de Gogol, es una aventura trepidante, una sinfonía en perpetuo crescendo, en la que cada capítulo es más intenso y sorprendente que el anterior. un fresco tan afinadamente dibujado y tan vívido que resulta absolutamente intemporal.",
      "image": "http://books.google.com/books/content?id=XdMBTKWSfeMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 12,
      "title": "Number One Ladies' Detective Agency",
      "author": "Alexander McCall Smith",
      "isbn": "9781400031344",
      "description": "Working in Gaborone, Botswana, sleuth Precious Ramotswe investigates several local mysteries, including a search for a missing boy and the case of the clinic doctor with different personalities for different days of the week. Reprint. 12,500 first printing.",
      "image": "http://books.google.com/books/content?id=ppb6XgPV0foC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 13,
      "title": "A Portrait of the Artist as a Young Man",
      "author": "James Joyce",
      "isbn": "9781387679249",
      "description": "James JoyceÕs 1916 novella A Portrait of the Artist as a Young Man is about the early manhood of Stephen Dedalus, later one of the leading characters in Ulysses. StephenÕs growing self-awareness as an artist forces him to reject the whole narrow world in which he has been brought up, including family ties, nationalism, and the Catholic religion.",
      "image": "http://books.google.com/books/content?id=-sZSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 14,
      "title": "The Path of the King",
      "author": "John Buchan",
      "isbn": "9781609778477",
      "description": "We wonder that so great a man as Abraham Lincoln should spring from humble people — but who knows what his more distant ancestry might have been? In a series of dramatic chapters, Mr. Buchan tells what he imagines to have been the ancestry of Lincoln. The worthy son of a northern chieftain who had come down with his people into Normandy; a Norman knight who fought under Duke William and settled in England; a French knight, emissary of Saint Louis to Kubla Khan; a proud demoiselle, friend to Jeanne d'Arc; a French gentleman who went with Columbus on his second voyage; an avenger of Saint Bartholomew's Day; a friend to Sir Walter Raleigh; a supporter of Cromwell; a soldier of fortune under Marlborough; a mighty hunter in Virginia—all these, says Mr. Buchan, were Lincoln's forebears. Their blood ran in his veins and made him, in James Russell Lowell's phrase, \"the last of the kings.\"",
      "image": "http://books.google.com/books/content?id=EpJlAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 15,
      "title": "The Prophet",
      "author": "Kahlil Gibran",
      "isbn": "9781529067415",
      "description": "A 20th century classic, The Prophet is thought-provoking, comforting and wise, and its simple truths remain compelling and rewarding to this day. Utterly unique and beloved around the world, The Prophet is a collection of twenty-six poetic essays by the Lebanese artist, philosopher and writer Kahlil Gibran. Telling the story of the prophet Al-Mustafa and his conversations with various acquaintances as he returns home after a long absence, the book touches on subjects of universal concern, including love, friendship, passion, pain, religion and freedom.",
      "image": "http://books.google.com/books/content?id=nAYBEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 16,
      "title": "Meridiana",
      "author": "Jules Verne",
      "isbn": "9798739560742",
      "description": "The Adventures of Three Russians and Three Englishmen in South Africa (French: Aventures de trois Russes et de trois Anglais dans l'Afrique australe) is a novel by Jules Verne published in 1872. Three Russian and three English scientists depart to South Africa to measure the 24th meridian east. As their mission is proceeding, the Crimean War breaks out, and the members of the expedition find themselves citizens of enemy countries. Fighting off hostile natives, animals, and other environmental hazards, these six stout scientists prepare themselves to endure any difficulty and danger in the pursuit of science!. Three Englishmen and Three Russians travel across the width of South Africa to measure a meridian. The outbreak of the Crimean War makes the Russians enemy agents in an English colony.",
      "image": "http://books.google.com/books/content?id=s2ZnzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 17,
      "title": "Mysteries",
      "author": "Knut Hamsun",
      "isbn": "0141186186",
      "description": "The first complete English translation of the Nobel Prize-winner’s literary masterpiece A Penguin Classic Mysteries is the story of Johan Nilsen Nagel, a mysterious stranger who suddenly turns up in a small Norwegian town one summer—and just as suddenly disappears. Nagel is a complete outsider, a sort of modern Christ treated in a spirit of near parody. He condemns the politics and thought of the age, brings comfort to the “insulted and injured,” and gains the love of two women suggestive of the biblical Mary and Martha. But there is a sinister side of him: in his vest he carries a vial of prussic acid... The novel creates a powerful sense of Nagel's stream of thought, as he increasingly withdraws into the torture chamber of his own subconscious psyche. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,800 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
      "image": "http://books.google.com/books/content?id=MRoMUV2kLZEC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 18,
      "title": "The Guns of Navarone",
      "author": "Alistair MacLean",
      "isbn": "9780007289349",
      "description": "The classic World War II thriller from the acclaimed master of action and suspense.",
      "image": "http://books.google.com/books/content?id=e1ZZHkzMb6sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 19,
      "title": "Web of Dreams",
      "author": "V.C. Andrews",
      "isbn": "9781439187814",
      "description": "With nowhere to go, no one to help her, will Leigh flee into the arms of the one person she shouldn’t run to? Don’t miss this fifth and final installment in the Casteel family saga from New York Times bestselling author and literary phenomenon V.C. Andrews (Flowers in the Attic, My Sweet Audrina), now a major Lifetime movie event. Leigh VanVoreen had to escape from Boston’s Farthinggale Manor. The foul secret she harbored within her seemed to darken her life forever. Jillian, her mother, would not believe her, and Tony Tatterton, her stepfather, had betrayed her cruelly. But the pure devotion of Luke Casteel promised her hope and respect. Only Luke knew her deepest of secrets…only Luke would love and protect her. Bravely she bore the suspicions of the Willies’ hillfolk, as she tried to grasp the happiness that had so long eluded her. Leigh prayed with all her heart that her bright, shining dreams would save her from tragedy at last…",
      "image": "http://books.google.com/books/content?id=7WjitMEwF78C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "source": "Google Books"
    },
    {
      "rank": 20,
      "title": "The Picture of Dorian Gray Illustrated",
      "author": "Oscar Wilde",
      "isbn": "9798655176461",
      "description": "The Picture of Dorian Gray is a Gothic and philosophical novel by Oscar Wilde, first published complete in the July 1890 issue of Lippincott's Monthly Magazine.Fearing the story was indecent, the magazine's editor deleted roughly five hundred words before publication without Wilde's knowledge. Despite that censorship, The Picture of Dorian Gray offended the moral sensibilities of British book reviewers, some of whom said that Oscar Wilde merited prosecution for violating the laws guarding public morality. In response, Wilde aggressively defended his novel and art in correspondence with the British press, although he personally made excisions of some of the most controversial material when revising and lengthening the story for book publication the following year.",
      "image": "http://books.google.com/books/content?id=xwSWzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "source": "Google Books"
    }
  ],
  "timestamp": "2026-02-11T11:06:05.718Z"
}